# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11n-SimAM
scale: n
depth_multiple: 0.50
width_multiple: 0.25
nc: 1
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] 
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 2, C2f_SimAM, [128, True, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] 
  - [-1, 2, C2f_SimAM, [256, True, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 2, C2f_SimAM, [512, True, 0.25]]
  - [-1, 1, Conv, [1024, 3, 2]] 
  - [-1, 2, C2f_SimAM, [1024, True, 0.25]]
  - [-1, 1, SPPF, [1024, 5]] 

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f_SimAM, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f_SimAM, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C2f_SimAM, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C2f_SimAM, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]