# ResNet50 + YOLOv11 Head (Baseline)
# 泛化性实验：基准版本 (无 LECA)

# Parameters
nc: 80 # 改为你的类别数
scales:
  n: [0.33, 2.25, 1024] 

backbone:
  # 官方 ResNet50 结构
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]   # 0
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]] # 1 (P2)
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # 2 (P3)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]] # 3 (P4)
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # 4 (P5)
  - [-1, 1, SPPF, [2048, 5]] # 5 (SPPF)

# YOLO Head (索引连接到原始 ResNet 层: 2, 3, 5)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6
  - [[-1, 3], 1, Concat, [1]] # 7: cat P4 (层 3)
  - [-1, 3, C3k2, [512, False]] # 8

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9
  - [[-1, 2], 1, Concat, [1]] # 10: cat P3 (层 2)
  - [-1, 3, C3k2, [256, False]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 12
  - [[-1, 8], 1, Concat, [1]] # 13: cat head P4
  - [-1, 3, C3k2, [512, False]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 15
  - [[-1, 5], 1, Concat, [1]] # 16: cat SPPF (层 5)
  - [-1, 3, C3k2, [1024, True]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]] # 18: Detect