# ResNet50 + LECA + YOLOv11 Head
# 泛化性实验：LECA 版本

# Parameters
nc: 80  # 记得改为你的实际类别数 (如 1 或 2)
scales:
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # 官方 ResNet50 结构 (from rtdetr-l)
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]   # 0: Stem
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]] # 1: Layer1 (P2)

  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # 2: Layer2 (P3)
  - [-1, 1, LECA, []] # 3: <--- LECA (P3)

  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]] # 4: Layer3 (P4)
  - [-1, 1, LECA, []] # 5: <--- LECA (P4)

  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # 6: Layer4 (P5)
  - [-1, 1, LECA, []] # 7: <--- LECA (P5)
  
  - [-1, 1, SPPF, [2048, 5]] # 8: SPPF

# YOLO Head (索引连接到 LECA 层: 3, 5, 8)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9
  - [[-1, 5], 1, Concat, [1]] # 10: cat P4 (LECA层 5)
  - [-1, 3, C3k2, [512, False]] # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 3], 1, Concat, [1]] # 13: cat P3 (LECA层 3)
  - [-1, 3, C3k2, [256, False]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16: cat head P4
  - [-1, 3, C3k2, [512, False]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19: cat SPPF (层 8)
  - [-1, 3, C3k2, [1024, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # 21: Detect